public class Task1_3_3_1 {
    public static void main(String[] args) {
        System.out.println("Задание: \n1.  Напишите программу, в которой переменная x " +
                "объявляется 10 раз\n\nРешение: ");

        int i = 1;
        while (i < 11) {
            int x = i;
            System.out.println(x);
            i++;
        }
        System.out.println("Done!");
    }
}